class Codeinfo:

    nice_code = {
        'KB증권' : '1127470',
        'NH투자증권' : '1341982',
        '삼성증권' : '1124978',
        '신한금융투자' : '1455445',
        '한국투자증권' : '1801883',
        '하나금융투자' : '1267050',
        '미래에셋증권' : '1126649',
        'IBK투자증권' : '5001136',
        '유안타증권' : '1493741',
        '한화투자증권' : '1982719',
        '하이투자증권' : '1770244',
        '대신증권' : '1188609',
        '메리츠증권' : '1144918',
        '키움증권' : '1682530',
        '신영증권' : '1117045',
        '현대차증권' : '1836222',
        '교보증권' : '1381267'
    }


    kr_code = {
        'KB증권' : '801322',
        'NH투자증권' : '800568',
        '삼성증권' : '806224',
        '신한금융투자' : '800782',
        '한국투자증권' : '801156',
        '하나금융투자' : '807020',
        '미래에셋증권' : '800404',
        'IBK투자증권' : '803023',
        '유안타증권' : '800526',
        '한화투자증권' : '800880',
        '하이투자증권' : '800918',
        '대신증권' : '800396',
        '메리츠증권' : '801275',
        '키움증권' : '817470',
        '신영증권' : '800731',
        '현대차증권' : '800773',
        '교보증권' : '800440'
    }

    kis_code = {
        'KB증권' : '860263',
        'NH투자증권' : '860301',
        '삼성증권' : '821616',
        '신한금융투자' : '860280',
        '한국투자증권' : '091255',
        '하나금융투자' : '147568',
        '미래에셋증권' : '860085',
        'IBK투자증권' : 'C17557',
        '유안타증권' : '860255',
        '한화투자증권' : '860026',
        '하이투자증권' : '126106',
        '대신증권' : '860077',
        '메리츠증권' : '860204',
        '키움증권' : '128814',
        '신영증권' : '860336',
        '현대차증권' : '860140',
        '교보증권' : '860115'
    }



class Urlinfo:
    nice_url = "https://www.nicerating.com/disclosure/companyGradeInfo.do?cmpCd="

    kr_url = "http://www.rating.co.kr/disclosure/QDisclosure004.do?companyCode="

    kis_url = "https://www.kisrating.com/ratingsSearch/corp_overview.do?kiscd="